feat: mermaid-diagram for login-sequence of Readme (#91)
## fixes KILTProtocol/ticket#NoTicket
